Revit 2027 API
InstanceNode.GetSymbolGeometryId Method
 Gets the SymbolGeometryId associated with the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SymbolGeometryId GetSymbolGeometryId()
Public Function GetSymbolGeometryId As SymbolGeometryId
public:
SymbolGeometryId^ GetSymbolGeometryId()
member GetSymbolGeometryId : unit -> SymbolGeometryId
Return Value
SymbolGeometryId
Remarks
 Use the strings returned by SymbolGeometryId.AsIdentifier(bool) to check if two nodes point to the same geometry of the symbol.
See Also
Reference
InstanceNode Class
Autodesk.Revit.DB Namespace